# 1.Introduction
 This assignment will help you to consolidate the concepts learnt in the session.
# 2.Problem Statement

 It happens all the time: someone gives you data containing malformed strings,
 Python, lists and missing data. How do you tidy it up so you can get on with the
 analysis?
 Take this monstrosity as the DataFrame to use in the following puzzles:

In [367]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from io import StringIO,BytesIO
%matplotlib inline

In [368]:
# CREATE DATAFRAME.
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [369]:
# TOP 5 ROW OF DATAFRAME.
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [370]:
# FILLING MISSING NUMBERS. 
df.loc[df.From_To == "MAdrid_miLAN", 'FlightNumber'] = 10055
df.loc[df.From_To == "Budapest_PaRis", 'FlightNumber'] = 10075

In [371]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [372]:
#CONVERTING THE FLIGHTNUMBER COLUMN FROM FLOAT TO INTEGER.
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [373]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

### 2. The From_To column would be better as two separate columns! Split each       string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [374]:
#SPLITTING Form_To TO CREATE A NEW TEMPORARY DATAFRAME.
tempdata1= df["From_To"].str.split("_", n = 1, expand = True) 
tempdata1

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [375]:
tempdata=pd.DataFrame(data=tempdata1,index=index1)

In [376]:
tempdata

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [377]:
# ASSIGNING THE COLUMN NAMES TO THESE TEMPORARY DATA FRAMES.
tempdata.rename(columns={0:'City1',1:'City2'},inplace=True)

In [378]:
tempdata

      City1      City2
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

###  3.Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [379]:
# CAPITALIZING THE CITIY NAMES IN THE COLUMNS.
tempdata['City1']=tempdata['City1'].str.capitalize()
tempdata['City2']=tempdata['City2'].str.capitalize()

In [380]:
tempdata

      City1      City2
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

### 4.Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [381]:
# DELETING From_To COLUMN FROM THE DATAFRAME.
df.drop('From_To',axis=1,inplace=True)

In [382]:
# ATTACHING THE TEMPORARY DATAFRAME PREVIOSULY CREATETD TO THE OG DATA.
newdf=pd.concat([df,tempdata],axis=1)

In [383]:
newdf

   FlightNumber  RecentDelays              Airline     City1      City2
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

### 5.In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays. Note: Solution submitted via github must contain

In [384]:
# SEPERATING THE DATA IN RecentDelays COLUMN WHICH IS IN THE FORMAT OF LIST.
pd.DataFrame(newdf.RecentDelays.tolist(), index= df.index)

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [385]:
# NAMING THE NEWLY CREATED COLUMNS OF THE DATDAFRAME.
Delay=pd.DataFrame(newdf['RecentDelays'].to_list(), columns=['delay_1','delay_2','delay_3'])

In [386]:
Delay

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [387]:
FinalDF=pd.concat([newdf,Delay],axis=1)

In [388]:
FinalDF

,FlightNumber,RecentDelays,Airline,City1,City2,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [389]:
# RENAMING THE RecentDelays column with the name delays. 
FinalDF.rename(columns = {"RecentDelays": "delays"},inplace=True)

In [390]:
# THIS THE FINAL DATASET AFTER THE CLEANING.
FinalDF

,FlightNumber,delays,Airline,City1,City2,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN